{"basics":{"name":"Srecharan Selvam","email":"srecharan@gmail.com","phone":"+1-917-495-3410","location":{"city":"Pittsburgh","countryCode":"US","region":"PA"},"profiles":[{"network":"LinkedIn","url":"linkedin.com/in/srecharan"},{"network":"GitHub","url":"github.com/Srecharan"}]},"education":[{"institution":"Carnegie Mellon University","location":"Pittsburgh, PA","studyType":"Master of Science","area":"Research: Machine Learning","startDate":"2023-08","endDate":"2025-05","score":"4.0/4.0","courses":["Machine Learning","Deep Learning","Advanced Computer Vision","Visual Recognition"]}],"work":[{"name":"Kantor Lab, Carnegie Mellon University","position":"Graduate Research Assistant","location":"Pittsburgh, PA","startDate":"2023-08","endDate":"Present","highlights":["Developed a Vision Language Action (VLA) system through LoRA fine-tuning of LLaVA-1.5-7B (CLIP + Vicuna) foundation model, adapting multimodal reasoning from text generation to action prediction for robotic leaf manipulation","Automated data creation via self-supervised learning pipeline, eliminating 100% manual annotation for GraspPointCNN","Trained attention-based GraspPointCNN using MLflow to track 60+ model experiments for grasp point optimization","Boosted inference (20→27 FPS) by parallelizing 3D projection with CUDA kernels & compiling models with TensorRT","Deployed Dockerized VLA-enhanced grasping stack to a 6-DOF robot, achieving 82% leaf grasp success rate in field tests"]},{"name":"Hanon Systems","position":"Machine Learning Engineer Intern","location":"Chennai, India","startDate":"2023-01","endDate":"2023-06","highlights":["Built GRU-based 3D hand gesture (dynamic/static) recognition model trained on custom dataset with EKF smoothing for real-time AR interface (Unity), allowing 100+ automotive technicians to safely simulate HVAC assembly procedures","Optimized inference using CUDA kernels and ONNX quantization, cutting latency by 33% & memory footprint by 50%","Exposed gesture and depth modules via Flask REST APIs for modular model serving to downstream applications","Containerized complete pipeline by utilizing Docker for consistent, scalable deployment across 3 training centers"]},{"name":"Vee Ess Engineering","position":"Computer Vision Engineer Intern","location":"Chennai, India","startDate":"2022-07","endDate":"2022-12","highlights":["Engineered distributed Apache Spark pipeline to boost recyclable material recovery on high-speed conveyors by handling terabytes of multi-camera footage and auto-annotating frames with Mask R-CNN to create 43,000+ segmented images","Streamlined dataset storage & versioning via AWS S3 to reduce I/O overhead by 24% and accelerate training iterations","Integrated custom-trained YOLOv5 model across real-time camera streams yielding 96% mAP@[0.5:0.95] with <15ms latency, enabling conveyor speed modulation based on detection density to cut manual sorting labor by 6+ hrs/week"]}],"projects":[{"name":"VLM-Based Tool Recognition System for Industrial Safety Applications","startDate":"2025-01","endDate":"2025-05","highlights":["Fine-tuned Qwen-2.5-VL-7B & LLaMA-3.2-11B-V using LoRA on custom dataset via LLM-guided prompt engineering (8K images, 29K annotations) for real-time multi-modal industrial tool recognition and safety guidance generation","Built a RAG pipeline using LangChain and Pinecone to ground tool-specific information, reducing hallucinations by 55%","Implemented RLHF (GRPO) on AWS SageMaker to optimize preference learning on paired responses for VLM alignment","Orchestrated LLM-based evaluation pipeline (OpenAI API) with Kubernetes, scoring 4K+ outputs for 8 model variants"]},{"name":"Multi-Model Stock Prediction with NLP and Automated Trading","startDate":"2024-10","endDate":"2025-02","highlights":["Spearheaded distributed training infrastructure using data parallelism across 4x V100 GPUs to train ensemble ML models (bidirectional LSTM + XGBoost with 35+ features) for algorithmic trading system across multiple timeframes","Created Kafka streaming pipeline to ingest 9K financial events/day from multiple APIs for low-latency trading decisions","Automated Apache Airflow workflows managing FinBERT sentiment analysis, boosting prediction accuracy by∼5%","Designed automated trading system with CI/CD model retraining and Tradier API execution, delivering 58.5% win rate"]},{"name":"GenAI for Synthetic Data Augmentation: GANs, VAEs & Diffusion","startDate":"2024-04","endDate":"2024-07","highlights":["Trained WGAN-GP, β-VAE, and DDPM on CUB-200-2011 to generate synthetic bird images for classifier augmentation","Produced 18K synthetic images across 200 bird classes with optimized mixing ratios to address training data limitations","Validated synthetic data utility through ResNet-50, achieving 5.1% accuracy gains and 15% boost in low-data scenarios"]}],"skills":[{"name":"Languages & Frameworks","keywords":["Python","C++","SQL","PyTorch","TensorFlow","OpenCV","scikit-learn","Transformers","ONNX","Git"]},{"name":"ML Training","keywords":["RAG","RLHF (GRPO, DPO)","SFT","PEFT","LoRA","VLM/LLM Fine-tuning","Distributed Training","LangChain"]},{"name":"Infrastructure","keywords":["AWS (SageMaker, EC2, S3)","GCP","Docker","Kubernetes","TensorRT","CUDA","MLflow","Kafka","Spark","Flask"]}],"publications":[{"name":"Self-Supervised Learning for Robotic Leaf Manipulation: A Hybrid Geometric-Neural Approach","publisher":"arXiv:2505.03702","releaseDate":"2025","website":"http://arxiv.org/abs/2505.03702","summary":"Under review at IEEE ICCV 2025","authors":["Srecharan Selvam","Abhisesh Silwal","George Kantor"]},{"name":"Unraveling the role of micro-arc oxidation process factors on the corrosion resistance of magnesium alloy microtubes","publisher":"Materials Today: Proceedings","releaseDate":"2024","website":"https://doi.org/10.1016/j.matpr.2022.09.451","summary":"Vol. 72, No. 4, pp. 2450-2455","authors":["Lakshminarayanan A K","Vishwa S","Srecharan Selvam"]},{"name":"Role of oscillation frequency and amplitude on the microstructure & properties of linear friction welded Ni. Al. CuSn. joints","publisher":"Physica Scripta","releaseDate":"2023","website":"","summary":"Vol. 99, No. 6","authors":["Lakshminarayanan A K","Vishwa S","Srecharan Selvam"]}],"awards":[{"title":"Best Bachelor's Thesis Award","date":"2023","summary":"This award was given for exceptional research in manufacturing engineering utilizing artificial intelligence for optimization of welding parameters. The thesis demonstrated innovative approaches to improve production efficiency through machine learning algorithms and computer vision techniques."},{"title":"Best Innovation Award","date":"2022","summary":"Received at the International Conference on Processing and Characterization of Materials (ICPCM) for novel research on material processing techniques that demonstrated significant improvements in efficiency and quality control.","url":"https://doi.org/10.1016/j.matpr.2022.09.451"},{"title":"Youth Red Cross Core Member","date":"2021","summary":"Led critical health campaigns including organizing multiple blood donation camps that collected over 500 units. Coordinated rural area cleaning initiatives and conducted educational workshops for underserved communities focusing on basic health and hygiene practices. Recognized for outstanding leadership and community service initiatives."}]}