{
  "basics": {
    "name": "Srecharan Selvam",
    "email": "sselvam@andrew.cmu.edu",
    "phone": "+1-917-495-3410",
    "location": {
      "city": "Pittsburgh",
      "countryCode": "US",
      "region": "PA"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "linkedin.com/in/srecharan"
      },
      {
        "network": "GitHub",
        "url": "github.com/Srecharan"
      }
    ]
  },
  "education": [
    {
      "institution": "Carnegie Mellon University",
      "location": "Pittsburgh, PA",
      "studyType": "Master of Science",
      "area": "Research: Machine Learning",
      "startDate": "2023-08",
      "endDate": "2025-05",
      "score": "4.0/4.0",
      "courses": [
        "Machine Learning",
        "Deep Learning",
        "Advanced Computer Vision",
        "Visual Recognition"
      ]
    }
  ],
  "work": [
    {
      "name": "Kantor Lab, Carnegie Mellon University",
      "position": "Graduate Research Assistant",
      "location": "Pittsburgh, PA",
      "startDate": "2023-08",
      "endDate": "Present",
      "highlights": [
        "Engineered real-time vision system for autonomous leaf grasping integrating YOLOv8 segmentation, RAFT-Stereo depth estimation & custom CNN (GraspPointCNN), featuring self-supervised data generation and weighted decision framework",
        "Built self-supervised data generation pipeline using geometric features (SDF, gradients), eliminating manual annotation",
        "Finetuned YOLOv8 on custom dataset of 900+ plant images, achieving 68% mAP@[0.5:0.95] for leaf mask generation",
        "Optimized RAFT-Stereo pipeline for precise grasping, attaining sub-pixel accuracy (<0.5px) on 1080p stereo pairs",
        "Trained GraspPointCNN with spatial attention for grasp point selection, reaching 97.09% recall and 92.59% precision",
        "Developed a confidence-weighted decision system merging geometric scoring algorithms (70-90%) and CNN predictions (10-30%), improving leaf grasping success rate by 4.66% over scoring-only baseline across 150 test cases"
      ]
    },
    {
      "name": "Hanon Systems",
      "position": "Machine Learning Engineer Intern",
      "location": "Chennai, India",
      "startDate": "2023-01",
      "endDate": "2023-06",
      "highlights": [
        "Architected a real-time 3D hand tracking and gesture recognition system in Unity AR, enabling over 50 automotive technicians to practice precise component placement and assembly procedures for virtual HVAC systems",
        "Implemented Extended Kalman Filter for robust 3D hand tracking, with < 7.5mm ground truth tracking accuracy",
        "Designed geometric analysis pipeline for static hand gesture recognition (grab, pinch, point, open palm) with 97% acc",
        "Trained custom GRU neural network to recognize dynamic hand motions (swipe, circle, wave) attaining < 30ms latency",
        "Optimized hand tracking using ONNX, delivering 33% faster inference with 50% smaller model size than MediaPipe",
        "Integrated WebSockets between Python backend and Unity frontend, driving 30Hz data streaming with <1KB packets"
      ]
    },
    {
      "name": "Vee Ess Engineering",
      "position": "Computer Vision Engineer Intern",
      "location": "Chennai, India",
      "startDate": "2022-07",
      "endDate": "2022-12",
      "highlights": [
        "Developed a multi-camera vision system using YOLOv5 to enhance high-value material recovery amidst low-value debris through material sorting and conveyor speed modulation, demonstrating 96.8% mAP@[0.5:0.95] detection accuracy",
        "Accelerated dataset creation using fine-tuned Mask R-CNN for auto mask generation, creating 43k+ segmented images",
        "Boosted detection robustness through custom data augmentation pipeline, incorporating synthetic object compositing",
        "Minimized false positives in material counting through worker-interaction filtering, combining ROI-based MOG2 (Mixture of Gaussian) background subtraction with YOLOv5 person tracking and worker-induced occlusion handling",
        "Achieved <15ms inference latency with 74.5% mAP@[0.5:0.95] worker detection precision for safety monitoring"
      ]
    }
  ],
  "projects": [
    {
      "name": "Vision-Language Understanding via Retrieval & Feedback Alignmen",
      "startDate": "2025-01",
      "endDate": "2025-05",
      "highlights": [
        "Established a Vision-Language (V-L) Understanding architecture for industrial tool recognition with safety guidance generation, using Qwen-2.5-VL-7B & Llama-3.2-11B-Vision models fine-tuned on custom dataset with safety annotations",
        "Implemented PEFT (LoRA) across V-only, L-only, V+L strategies, boosting tool recognition precision from 35% to 72%",
        "Built RAG pipeline (FAISS & Sentence Transformers) to augment safety guidance, achieving ~90% information accuracy",
        "Incorporated RLHF using Group Relative Policy Optimization (GRPO) to align fine-tuned VLMs with structured safety information generation, resulting in 80-85% of RAG's information accuracy with 30% lower inference latency",
        "Crafted LLM-based scoring system (Gemini API) to assess accuracy/completeness of domain-specific safety instructions"
      ]
    },

    {
      "name": "Multi-Model Stock Prediction with NLP & Automated Trading",
      "startDate": "2024-10",
      "endDate": "2025-02",
      "highlights": [
        "Built end-to-end automated trading system combining stock prediction (bidirectional LSTM + XGBoost) with real-time FinBERT market sentiment analysis (news/Reddit/SEC), yielding 55-65% directional accuracy for multiple timeframes",
        "Created a dynamically-weighted ensemble model using LSTM (attention-based time-series) and XGBoost (35+ market features) with adaptive learning rate, attaining MAE of 0.27-0.44% across intraday timeframes (5m, 15m, 30m, 1h)",
        "Leveraged FinBERT to process 360+ financial texts, boosting ~5% prediction accuracy using 12 temporal features",
        "Simulated trading via Tradier API with risk management, showing 58.5% win rate and +0.32% net return"
      ]
    },
    {
      "name": "Vision-Language Understanding via Retrieval & Feedback Alignment",
      "startDate": "2024-04",
      "endDate": "2024-07",
      "highlights": [
        "Benchmarked generative model architectures (GANs, VAEs, Diffusion Models) by developing custom loss functions and training pipelines on the CUB-200-2011 dataset, optimizing performance for image quality and model stability",
        "Designed two GAN variants (LSGAN, WGAN-GP) implementing custom ResBlocks, with gradient penalty optimization",
        "Applied β annealing to improve VAE reconstruction fidelity while balancing sample diversity, and accelerated diffusion via DDIM sampling with 10× fewer steps (100 vs 1000), maintaining comparable quality (FID: 38.32 vs DDPM 34.73)",
        "Delivered best image quality with WGAN-GP (33.07 FID), outperforming diffusion models by 4.7%"
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": ["Python", "C++", "JavaScript", "SQL"]
    },
    {
      "name": "Frameworks",
      "keywords": ["PyTorch", "TensorFlow", "OpenCV", "scikit-learn", "pandas", "CUDA", "ROS2", "ONNX", "Unsloth", "Transformer", "TRL (Transformer Reinforcement Learning)", " FAISS"]
    },
    {
      "name": "ML Training & Alignment",
      "keywords": ["SFT", "RLHF (GRPO, DPO)", "RAG", "VLM/LLM Fine-tuning", "PEFT", "Distributed Training", "LLM Evaluation"]
    },
    {
      "name": "Deployment",
      "keywords": ["AWS (SageMaker, EC2)", "GCP(Vertex AI)", "Azure", "Docker"]
    }
  ],
  "publications": [
  {
    "name": "Self-Supervised Learning for Robotic Leaf Manipulation: A Hybrid Geometric-Neural Approach",
    "publisher": "arXiv:2505.03702",
    "releaseDate": "2025",
    "website": "http://arxiv.org/abs/2505.03702",
    "summary": "To be submitted to CVPR 2026",
    "authors": ["Srecharan Selvam", "Abhisesh Silwal", "George Kantor"]
  },
  {
    "name": "Unraveling the role of micro-arc oxidation process factors on the corrosion resistance of magnesium alloy microtubes",
    "publisher": "Materials Today: Proceedings",
    "releaseDate": "2024",
    "website": "https://doi.org/10.1016/j.matpr.2022.09.451",
    "summary": "Vol. 72, No. 4, pp. 2450-2455",
    "authors": ["Lakshminarayanan A K", "Vishwa S", "Srecharan Selvam"]
  },
  {
    "name": "Role of oscillation frequency and amplitude on the microstructure & properties of linear friction welded Ni. Al. CuSn. joints",
    "publisher": "Physica Scripta",
    "releaseDate": "2023",
    "website": "",
    "summary": "Vol. 99, No. 6",
    "authors": ["Lakshminarayanan A K", "Vishwa S", "Srecharan Selvam"]
  }
  ],
  "awards": [
    {
      "title": "Best Bachelor's Thesis Award",
      "date": "2023",
      "summary": "This award was given for exceptional research in manufacturing engineering utilizing artificial intelligence for optimization of welding parameters. The thesis demonstrated innovative approaches to improve production efficiency through machine learning algorithms and computer vision techniques."
    },
    {
      "title": "Best Innovation Award",
      "date": "2022",
      "summary": "Received at the International Conference on Processing and Characterization of Materials (ICPCM) for novel research on material processing techniques that demonstrated significant improvements in efficiency and quality control.",
      "url": "https://doi.org/10.1016/j.matpr.2022.09.451"
    },
    {
      "title": "Youth Red Cross Core Member",
      "date": "2021",
      "summary": "Led critical health campaigns including organizing multiple blood donation camps that collected over 500 units. Coordinated rural area cleaning initiatives and conducted educational workshops for underserved communities focusing on basic health and hygiene practices. Recognized for outstanding leadership and community service initiatives."
    }
  ]
}